{
  "backend/main.mo": "Motoko canister managing songs, personal songs, and user profiles with access control and upload operations for admins and users.",
  "feature_evidence.json": "Collection of feature evidence entries linking layout and mobile sidebar requirements to specific frontend files and components.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to short descriptions of their purpose and recent updates.",
  "frontend/index.css": "Tailwind base layer defining theme color tokens for light/dark modes and applying global background and text styles.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, and mounting the root React app.",
  "frontend/src/App.tsx": "Main React router setup defining routes, layout, theme provider, and global toaster.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Component gating admin routes with login checks, admin checks, and user-friendly fallback UI.",
  "frontend/src/components/admin/SongEditorDialog.tsx": "Modal dialog for creating or editing songs with file uploads, metadata inputs, and progress tracking.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity authentication and query cache clearing.",
  "frontend/src/components/branding/FourleafBrand.tsx": "Renders Fourleaf brand logo in full, compact, or icon variants.",
  "frontend/src/components/catalog/CatalogSongRowCard.tsx": "Displays a song row with play controls, metadata, cover art, and download button.",
  "frontend/src/components/catalog/DownloadButton.tsx": "Download button handling auth, subscription checks, and audio file download with UI states.",
  "frontend/src/components/catalog/PublicSongUploadDialog.tsx": "Dialog for uploading public songs with metadata fields, file inputs, and progress tracking.",
  "frontend/src/components/home/HorizontalSnapRow.tsx": "Scrollable horizontal row with snap behavior for child elements.",
  "frontend/src/components/home/StreamingCard.tsx": "Clickable song card with cover art, play button, and transition context setup.",
  "frontend/src/components/home/StreamingSection.tsx": "Section wrapper showing a title, optional icon, show-all button, and content.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with sidebars, header login button, content outlet, audio player, and profile setup dialog.",
  "frontend/src/components/layout/HeaderSearchBar.tsx": "Search bar with home navigation, query input, and a browse menu with accessibility and UI sound handling.",
  "frontend/src/components/layout/HomeTabBar.tsx": "Renders a simple tab bar to switch between home browsing categories.",
  "frontend/src/components/layout/LeftSidebar.tsx": "Sidebar providing navigation links, admin access, branding, and UI sound settings.",
  "frontend/src/components/layout/RightDetailsPanel.tsx": "Displays current song details or a placeholder when nothing is playing.",
  "frontend/src/components/personal/PersonalSongUploadDialog.tsx": "Dialog for uploading personal songs with metadata, authentication checks, and upload progress tracking.",
  "frontend/src/components/player/AudioPlayerBar.tsx": "Audio player bar handling playback, streaming sources, timing, volume, and queue controls.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Prompts new authenticated users to set up their profile with name and subscription status.",
  "frontend/src/components/settings/UISoundControls.tsx": "Settings panel to enable UI sounds and adjust their volume.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAudioQueue.ts": "Provides a Zustand-powered audio queue with playback controls, navigation, metadata tracking, and UI transition context.",
  "frontend/src/hooks/useHeaderSearch.ts": "Simple Zustand store for managing the header search query.",
  "frontend/src/hooks/useHomeBrowsing.ts": "Zustand store for tracking the active home tab and scroll reset triggers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context and provider, handling login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating songs, profiles, and user-specific data via the backend actor.",
  "frontend/src/hooks/useUISounds.ts": "Provides a hook for playing UI click sounds using stored sound settings.",
  "frontend/src/hooks/useUISoundSettings.ts": "Persistent Zustand store for toggling UI sound effects and volume.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes, utilities, and animation rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard for listing, creating, editing, and deleting catalog songs with loading states and dialogs.",
  "frontend/src/pages/LibraryPage.tsx": "Public library page showing all songs with search, browsing tabs, recommendations, and playback integration.",
  "frontend/src/pages/MyLibraryPage.tsx": "User’s personal library with authentication gating, song filtering, playback, uploading, and deletion.",
  "frontend/src/pages/NowPlayingPage.tsx": "Full-screen now-playing interface showing artwork, song info, progress, and playback controls.",
  "frontend/src/pages/PlayerLayoutPage.tsx": "Layout page combining sidebar navigation, hero section, simple playback controls, and mock track list display.",
  "frontend/src/pages/PricingPage.tsx": "React page that renders three pricing plan cards with features, badges, and a free‑trial button.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, persist, and clear URL and sessionStorage parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling typography, container queries, and animate plugins.",
  "project_state.json": "Project metadata describing sidebar layout requirements, mobile behavior, design constraints, and known issues."
}