{
  "backend/main.mo": "Canister backend managing public and personal songs with access control, storage mixins, and CRUD-style upload and query methods.",
  "feature_evidence.json": "Feature evidence report linking a header UI update to affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing styles, components, hooks, and UI behaviors.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens for light/dark themes and global element styling.",
  "frontend/index.html": "HTML entry point setting up Fourleaf branding, favicon, and root mount point.",
  "frontend/src/App.tsx": "Main React app configuring routes, theme provider, and global toaster notifications.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Route guard enforcing login and admin checks, showing appropriate UI for denied or loading states.",
  "frontend/src/components/admin/GrantAdminControl.tsx": "Admin tool allowing existing admins to grant admin access by validating and submitting a Principal ID.",
  "frontend/src/components/admin/RequestAdminAccessCard.tsx": "Access-denied card displaying the caller's Principal ID with copy support and loading fallback.",
  "frontend/src/components/admin/SongEditorDialog.tsx": "Dialog for creating or editing songs, handling metadata fields, file selection, and upload progress using ExternalBlob.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button that triggers login or logout via Internet Identity with UI state handling.",
  "frontend/src/components/branding/FourleafBrand.tsx": "Renders Fourleaf branding SVG in multiple layout variants (full, compact, icon).",
  "frontend/src/components/catalog/CatalogSongRowCard.tsx": "Displays a song row with cover art, metadata, play controls, duration, and download button.",
  "frontend/src/components/catalog/DownloadButton.tsx": "Download button enforcing auth and subscription checks, handling audio download and UI states.",
  "frontend/src/components/catalog/PublicSongUploadDialog.tsx": "Dialog for uploading public songs with validation, file handling, and progress tracking.",
  "frontend/src/components/home/HorizontalSnapRow.tsx": "Horizontal scroll container with snap behavior for arranging child items.",
  "frontend/src/components/home/StreamingCard.tsx": "Song card with cover art and play control that triggers transition context for the audio queue.",
  "frontend/src/components/home/StreamingSection.tsx": "Section wrapper for streaming content with title, optional icon, and optional Show All button.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with sidebars, header, outlet content, audio player, and conditional profile setup dialog.",
  "frontend/src/components/layout/HeaderSearchBar.tsx": "Implements a search bar with home navigation, a browse menu, and query management with UI sound effects.",
  "frontend/src/components/layout/HomeTabBar.tsx": "Renders a simple tab bar to switch between All, Music, and Podcast home browsing tabs.",
  "frontend/src/components/layout/LeftSidebar.tsx": "Provides a navigational sidebar with mobile drawer behavior, admin links, and UI sound controls.",
  "frontend/src/components/layout/RightDetailsPanel.tsx": "Shows details for the currently playing song or a placeholder when nothing is playing, visible on large screens.",
  "frontend/src/components/personal/PersonalSongUploadDialog.tsx": "A dialog for uploading personal songs with validation, file handling, progress tracking, and authentication checks.",
  "frontend/src/components/player/AudioPlayerBar.tsx": "Implements the persistent audio player with playback controls, streaming logic, state sync, and queue handling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Dialog that prompts new authenticated users to enter name and subscription status and saves the profile via mutations.",
  "frontend/src/components/settings/UISoundControls.tsx": "UI panel to toggle UI sound effects and adjust volume using settings from a Zustand store.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user’s identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAudioQueue.ts": "Zustand store managing the audio playback queue, current track state, playback controls, and UI transitions.",
  "frontend/src/hooks/useHeaderSearch.ts": "Zustand store holding the header search query with setters and clear functionality.",
  "frontend/src/hooks/useHomeBrowsing.ts": "Zustand store handling the active home tab and scroll-to-browsing triggers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, persistence, and identity state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating songs, profiles, and related backend data via the actor.",
  "frontend/src/hooks/useUISounds.ts": "Hook that loads a click sound and provides a function to play it respecting UI sound settings.",
  "frontend/src/hooks/useUISoundSettings.ts": "Persistent Zustand store for enabling UI sounds and controlling their volume.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark modes, and custom utilities including scroll hiding, snap scrolling, hero background, and animations.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider and loads global CSS.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin interface for viewing, creating, editing, and deleting catalog songs with dialogs, stats, and loading states.",
  "frontend/src/pages/LibraryPage.tsx": "Public library page showing all songs with search, browsing tabs, recommendations, playback handling, and upload dialog.",
  "frontend/src/pages/MyLibraryPage.tsx": "Displays a user's personal song library with login gating, search, playback, upload, and deletion features.",
  "frontend/src/pages/NowPlayingPage.tsx": "Full‑screen now‑playing view with artwork, playback controls, progress/volume sliders, and navigation back to the main UI.",
  "frontend/src/pages/PlayerLayoutPage.tsx": "Player UI layout with playback controls, track list, and integration with the audio queue and song catalog.",
  "frontend/src/pages/PricingPage.tsx": "Renders pricing plans with feature lists, highlighting the most popular option and offering a trial button.",
  "frontend/src/utils/backendErrors.ts": "Converts backend error messages into simplified, user-friendly strings with special cases handled.",
  "frontend/src/utils/uploadValidation.ts": "Validates audio files, cover images, durations, and required fields with size limits and basic checks.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, supporting hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and plugins for the Fourleaf UI.",
  "project_state.json": "Project metadata describing current features, pending requests, and app UI enhancement context."
}