{
  "backend/main.mo": "Motoko canister managing public and personal songs, user profiles, access control, and admin/user upload flows with blob storage integration.",
  "feature_evidence.json": "Feature evidence report mapping song upload and branding requirements to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing various frontend files, their purposes, and feature-related behaviors.",
  "frontend/index.css": "Tailwind base style definitions with OKLCH theme variables and light/dark mode tokens applied globally.",
  "frontend/index.html": "Base HTML entry including Fourleaf branding, favicon, and root mount point.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, theming, admin guard, and global toasts.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Protects admin routes by checking authentication and admin status, rendering clear fallback UI for each state.",
  "frontend/src/components/admin/SongEditorDialog.tsx": "Dialog for creating or editing songs with file uploads, progress tracking, validation, and mutation calls.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with UI sounds and query cache reset.",
  "frontend/src/components/branding/FourleafBrand.tsx": "Renders the Fourleaf brand logo in full, compact, or icon variants using SVG and optional text.",
  "frontend/src/components/catalog/CatalogSongRowCard.tsx": "Displays a song row with cover art, metadata, play controls, duration, and a download button.",
  "frontend/src/components/catalog/DownloadButton.tsx": "Provides a download button with auth and subscription checks, handling audio file retrieval and download.",
  "frontend/src/components/catalog/PublicSongUploadDialog.tsx": "Implements a dialog for authenticated users to upload public songs with metadata, audio, and cover image support.",
  "frontend/src/components/home/HorizontalSnapRow.tsx": "Creates a horizontally scrollable, snap-aligned row container for child elements.",
  "frontend/src/components/home/StreamingCard.tsx": "Displays a clickable song card with cover art, play button, and transition context handling.",
  "frontend/src/components/home/StreamingSection.tsx": "Wraps a streaming section with a title, optional icon, and a 'Show all' button.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with mobile header, sidebars, routed content, audio player, and profile setup handling.",
  "frontend/src/components/layout/HeaderSearchBar.tsx": "A header search bar with home navigation, a browse menu, query state handling, and accessibility controls.",
  "frontend/src/components/layout/HomeTabBar.tsx": "Renders tab buttons for switching between All, Music, and Podcast browsing categories.",
  "frontend/src/components/layout/LeftSidebar.tsx": "A left navigation sidebar with brand, navigation links, optional admin link, and UI sound controls.",
  "frontend/src/components/layout/RightDetailsPanel.tsx": "Displays details of the currently playing song or a placeholder when nothing is playing.",
  "frontend/src/components/personal/PersonalSongUploadDialog.tsx": "A dialog for authenticated users to upload personal songs with metadata, file inputs, and progress tracking.",
  "frontend/src/components/player/AudioPlayerBar.tsx": "The main audio player bar handling playback logic, streaming, seeking, volume, and queue navigation.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Prompts new authenticated users to create a profile with a name and subscription flag.",
  "frontend/src/components/settings/UISoundControls.tsx": "Controls for enabling UI sound effects and adjusting their volume.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAudioQueue.ts": "Manages a Zustand-powered audio queue with playback state, navigation, and now-playing UI controls.",
  "frontend/src/hooks/useHeaderSearch.ts": "Simple Zustand store for a header search query with setters and clearing.",
  "frontend/src/hooks/useHomeBrowsing.ts": "Zustand store controlling the active home tab and scroll-reset behavior.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, state management, and an auth context using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating songs, profiles, and uploads using the actor.",
  "frontend/src/hooks/useUISounds.ts": "Utility hook to play UI click sounds respecting user sound settings.",
  "frontend/src/hooks/useUISoundSettings.ts": "Persistent Zustand store for toggling UI sounds and adjusting volume.",
  "frontend/src/index.css": "Tailwind base with custom light/dark theme variables, utilities, and UI styling rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard for listing, creating, editing, and deleting catalog songs with cover previews and dialogs.",
  "frontend/src/pages/LibraryPage.tsx": "Public library page showing all songs with search, recommendations, browsing tabs, and playback queue integration.",
  "frontend/src/pages/MyLibraryPage.tsx": "User’s personal library page with authentication check, personal song filtering, playback, uploads, and removal actions.",
  "frontend/src/pages/NowPlayingPage.tsx": "Fullscreen now‑playing view showing artwork, song info, progress controls, and playback/volume management.",
  "frontend/src/pages/PlayerLayoutPage.tsx": "Standalone player layout with sidebar navigation, hero section, playback controls, and sample track list.",
  "frontend/src/pages/PricingPage.tsx": "Renders a pricing page displaying weekly, monthly, and yearly subscription plans with feature lists and a highlighted popular option.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, retrieve, and clear URL and session-stored parameters, supporting both query and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and container settings, with plugins enabled for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, existing features, pending feature requests, and architectural notes for the website."
}