{
  "backend/main.mo": "Defines song types, storage maps, and access-controlled APIs for uploading, streaming, and managing public and personal songs. Integrates authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence record describing frontend changes needed for updated public upload permissions, including affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files covering styling, routing, hooks, components, and admin features.",
  "frontend/index.css": "Defines Tailwind base styles and custom OKLCH color variables for light and dark themes, applying them globally.",
  "frontend/index.html": "HTML entry point setting metadata, favicon, root mount node, and script loader.",
  "frontend/src/App.tsx": "Configures TanStack Router routes, global theme provider, and toast system for the application.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Protects admin routes by requiring authentication and admin role, showing login or access request UI when needed.",
  "frontend/src/components/admin/GrantAdminControl.tsx": "Admin tool for granting admin access by validating a Principal ID and submitting it via a mutation.",
  "frontend/src/components/admin/RequestAdminAccessCard.tsx": "Displays access-denied messaging with the caller's Principal ID and copy-to-clipboard support for requesting admin access.",
  "frontend/src/components/admin/SongEditorDialog.tsx": "Dialog for creating or editing songs, handling metadata, file uploads, and progress tracking.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button that triggers Internet Identity auth and updates query cache.",
  "frontend/src/components/branding/FourleafBrand.tsx": "Renders the Fourleaf brand logo in full, compact, or icon-only variants.",
  "frontend/src/components/catalog/CatalogSongRowCard.tsx": "Row-style card showing song info, cover, duration, play controls, and download option.",
  "frontend/src/components/catalog/DownloadButton.tsx": "Download button that checks auth and subscription status, fetches song audio, and triggers file download.",
  "frontend/src/components/catalog/PublicSongUploadDialog.tsx": "Dialog for uploading public songs with form validation, file handling, and upload progress.",
  "frontend/src/components/home/HorizontalSnapRow.tsx": "Horizontally scrollable snap row container for displaying items.",
  "frontend/src/components/home/StreamingCard.tsx": "Clickable streaming card displaying song cover and play button with transition context.",
  "frontend/src/components/home/StreamingSection.tsx": "Section wrapper with title, optional icon, show-all button, and content area.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with sidebar, header, content outlet, audio player bar, and profile setup dialog logic.",
  "frontend/src/components/layout/HeaderSearchBar.tsx": "Provides a search bar with home navigation, browse menu, and query handling with UI sound feedback.",
  "frontend/src/components/layout/HomeTabBar.tsx": "Renders tab buttons for switching between All, Music, and Podcast views on the home page.",
  "frontend/src/components/layout/LeftSidebar.tsx": "Implements the left navigation sidebar with links, admin access, branding, and UI sound controls.",
  "frontend/src/components/layout/RightDetailsPanel.tsx": "Shows a now-playing panel with song details or a placeholder when nothing is playing.",
  "frontend/src/components/personal/PersonalSongUploadDialog.tsx": "Dialog for uploading personal songs with form fields, file inputs, authentication checks, and upload progress.",
  "frontend/src/components/player/AudioPlayerBar.tsx": "Audio playback bar managing play controls, queue, streaming blobs, and timing updates using an HTML audio element.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Displays a required profile setup dialog for new authenticated users to enter name and subscription status.",
  "frontend/src/components/settings/UISoundControls.tsx": "UI component providing toggle and volume slider for UI sound effects using stored settings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAudioQueue.ts": "Zustand store managing audio playback queue, state, navigation, volume, and now-playing UI context.",
  "frontend/src/hooks/useHeaderSearch.ts": "Zustand store for tracking and updating the header search query.",
  "frontend/src/hooks/useHomeBrowsing.ts": "Zustand store for tracking active home browsing tab and scroll reset requests.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, storage, and status handling through a React context and AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating songs, profiles, and other backend data using the actor.",
  "frontend/src/hooks/useUISounds.ts": "Hook providing UI click sound playback respecting stored sound settings.",
  "frontend/src/hooks/useUISoundSettings.ts": "Persistent Zustand store storing UI sound toggle and volume settings.",
  "frontend/src/index.css": "Tailwind CSS setup with custom themes, utilities, and animations for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point initializing React, providers, and global QueryClient.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard listing songs with create, edit, and delete controls using query hooks and dialogs.",
  "frontend/src/pages/LibraryPage.tsx": "Public library page showing all songs with search, browsing sections, recommendations, and playback integration.",
  "frontend/src/pages/MyLibraryPage.tsx": "User’s personal library with login gating, personal song management, filtering, playback, and upload dialog.",
  "frontend/src/pages/NowPlayingPage.tsx": "Fullscreen now‑playing view with artwork, playback controls, progress slider, and navigation handling.",
  "frontend/src/pages/PlayerLayoutPage.tsx": "Layout with sidebar, hero section, basic playback controls, and sample track list using current audio queue state.",
  "frontend/src/pages/PricingPage.tsx": "Renders a pricing page with three subscription plans and feature lists using UI components.",
  "frontend/src/utils/backendErrors.ts": "Provides a function that normalizes raw backend error messages into clear, user-friendly text.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS config extending colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Stores project metadata, current issues, and feature requests related to public catalog upload permissions and backend behavior."
}