{
  "kind": "build_request",
  "title": "Add hamburger menu icon next to the Fourleaf logo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the app header so the hamburger menu icon button is placed directly next to the Fourleaf brand (logo/text), forming a single left-aligned cluster, while keeping the Login button right-aligned. Reuse the existing icon asset at \"/assets/generated/hamburger-menu.dim_24x24.svg\" and preserve current behavior (clicking the icon opens the mobile left sidebar drawer).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-1"
        ],
        "quotes": [
          "Place a hamburger menu icon next to the Fourleaf logo."
        ]
      },
      "acceptanceCriteria": [
        "On mobile breakpoints, the header shows a hamburger icon button immediately adjacent to the Fourleaf brand (logo/text) with consistent spacing and vertical alignment.",
        "Clicking/tapping the hamburger icon still opens the mobile LeftSidebar drawer exactly as before.",
        "The Login button remains right-aligned in the header and does not overlap the brand cluster.",
        "The hamburger button remains hidden on desktop (md and up) if that is the current behavior, unless the app already shows it on desktop.",
        "The hamburger icon button has an accessible aria-label (e.g., \"Open menu\")."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui (read-only shadcn components).",
    "Do not change authentication behavior or routing; this is a UI placement change only.",
    "Preserve the existing hamburger icon asset path: /assets/generated/hamburger-menu.dim_24x24.svg."
  ],
  "nonGoals": [
    "Creating a new hamburger icon asset.",
    "Changing how the mobile sidebar opens/closes beyond ensuring the existing behavior continues to work.",
    "Redesigning the overall header layout beyond placing the hamburger icon next to the Fourleaf logo."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}