{
  "kind": "build_request",
  "title": "Enable song file uploads and implement minimal circular clover header logo",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Enable and verify the end-to-end song file upload feature so authenticated users can upload an audio file (and optional cover image) and see the newly uploaded track appear in the appropriate library views (public catalog and personal library) without errors.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Enable the song file upload feature ."
        ]
      },
      "acceptanceCriteria": [
        "From the public Library page, clicking \"Upload Track\" opens the public upload dialog and successfully uploads an audio file; on success, the new track appears in the public catalog list (and total track count updates).",
        "From the My Library page, clicking \"Upload Track\" opens the personal upload dialog and successfully uploads an audio file; on success, the new track appears in the user’s personal library list.",
        "If the user is not authenticated, upload dialogs present a login-required state and do not attempt to upload.",
        "During upload, progress indicators update and the dialog cannot be dismissed via outside click/escape while uploading (no partial/duplicate uploads).",
        "Any backend authorization errors are surfaced as user-readable errors in the UI (English)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the current header logo icon rendering with a minimal, scalable four-leaf clover mark that matches the provided design constraints: a perfectly centered circular container with equal height/width, black background fill inside the circle, four equal rounded leaf shapes arranged in a balanced cross pattern touching seamlessly at the center (no visible gaps), rich premium green fill (not neon), and no text, shadows, gradients, or extra effects.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "First create a simple circle container for the logo area so it stays perfectly centered on the website header and keeps equal height and width for balance .Inside that container, place a black background to give strong contrast and make the green four-leaf stand out clearly .Create four equal leaf shapes with smooth rounded edges so they look natural and symmetrical rather than sharp or uneven .Arrange the four petals evenly in a cross pattern so each leaf touches at the center point, forming a clean and balanced four-leaf shape .Use a rich green tone for the petals, slightly vibrant but not neon, so it feels premium and minimal instead of flashy. Keep the spacing tight at the center so the leaves connect smoothly without visible gaps. Avoid adding any text, shadows, gradients, or extra effects because the design should stay minimal and powerful. Make sure the overall logo looks sharp, clean, and scalable so it maintains clarity on both desktop and mobile screens."
        ]
      },
      "acceptanceCriteria": [
        "In the app header (including the mobile header in AppLayout), the logo icon is perfectly centered in its allocated header area and remains a true circle with equal width and height at all breakpoints.",
        "The clover icon is rendered as a scalable vector (or equivalently sharp approach) and remains crisp on desktop and mobile screens.",
        "The logo icon uses a black circular background and four identical rounded green leaves arranged symmetrically in a cross pattern; the leaves meet cleanly at the center with no visible gaps.",
        "No text, shadows, gradients, glows, or other decorative effects are present in the logo mark.",
        "The change is implemented via the existing branding component (frontend/src/components/branding/FourleafBrand.tsx) without modifying any immutable framework/hook files."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration.mo if an actual stable-state change requires it.",
    "Do not edit frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding new subscription tiers or changing download/streaming access rules.",
    "Implementing third-party storage, external databases, or non-Internet-Computer upload infrastructure.",
    "Adding logo text, taglines, gradients, shadows, or additional branding effects beyond the minimal clover mark."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}