{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Song uploads UX hardening and minimal circular clover header logo",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure authenticated users can upload audio (and optional cover) end-to-end with progress, proper auth gating, and immediate library list/count updates.",
      "acceptanceCriteria": [
        "From the public Library page, clicking \"Upload Track\" opens the public upload dialog and successfully uploads an audio file; on success, the new track appears in the public catalog list (and total track count updates).",
        "From the My Library page, clicking \"Upload Track\" opens the personal upload dialog and successfully uploads an audio file; on success, the new track appears in the user’s personal library list.",
        "If the user is not authenticated, upload dialogs present a login-required state and do not attempt to upload.",
        "During upload, progress indicators update and the dialog cannot be dismissed via outside click/escape while uploading (no partial/duplicate uploads).",
        "Any backend authorization errors are surfaced as user-readable errors in the UI (English)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden auth-gated queries/mutations to prevent unauthorized calls from running under anonymous identity (e.g., personal library/profile queries), and ensure upload success immediately refreshes both the catalog list and total track count. Use the authorization component patterns to gate authenticated-only data fetching, and continue using blob-storage’s ExternalBlob (withUploadProgress) for uploads and progress reporting. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/catalog/PublicSongUploadDialog.tsx",
          "operation": "modify",
          "description": "Verify the public upload dialog enforces login-required state, prevents outside click/escape dismissal while uploading, shows reliable progress updates, and surfaces backend authorization failures as clear English error messages. Ensure the upload uses blob-storage ExternalBlob withUploadProgress and remains consistent with authorization gating. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/personal/PersonalSongUploadDialog.tsx",
          "operation": "modify",
          "description": "Verify the personal upload dialog enforces login-required state, prevents outside click/escape dismissal while uploading, shows reliable progress updates, and surfaces backend authorization failures as clear English error messages. Ensure the upload uses blob-storage ExternalBlob withUploadProgress and remains consistent with authorization gating. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LibraryPage.tsx",
          "operation": "modify",
          "description": "Confirm the \"Upload Track\" CTA continues to open the public upload dialog and that post-upload UI updates are reflected (new track visible and total count updated) via React Query invalidation/refetch behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/MyLibraryPage.tsx",
          "operation": "modify",
          "description": "Confirm the \"Upload Track\" CTA continues to open the personal upload dialog for authenticated users and that the personal library list updates immediately after upload without errors, relying on the auth-gated query behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Ensure any authenticated-only profile fetching used for the profile setup dialog does not trigger when the user is not authenticated (to avoid unauthorized traps/errors), aligning with authorization component guidance about hiding app data until logged in. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace the header icon logo with a minimal, scalable four-leaf clover inside a perfect black circle using the existing branding component.",
      "acceptanceCriteria": [
        "In the app header (including the mobile header in AppLayout), the logo icon is perfectly centered in its allocated header area and remains a true circle with equal width and height at all breakpoints.",
        "The clover icon is rendered as a scalable vector (or equivalently sharp approach) and remains crisp on desktop and mobile screens.",
        "The logo icon uses a black circular background and four identical rounded green leaves arranged symmetrically in a cross pattern; the leaves meet cleanly at the center with no visible gaps.",
        "No text, shadows, gradients, glows, or other decorative effects are present in the logo mark.",
        "The change is implemented via the existing branding component (frontend/src/components/branding/FourleafBrand.tsx) without modifying any immutable framework/hook files."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/branding/FourleafBrand.tsx",
          "operation": "modify",
          "description": "Replace the current raster <img> rendering for the icon variant with a crisp, scalable vector implementation: a perfectly circular container (equal width/height) with solid black fill and a minimal four-leaf clover mark composed of four identical rounded leaves in a balanced cross pattern meeting seamlessly at center, using a rich premium green fill (no neon). Ensure no text, shadows, gradients, or extra effects are introduced. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/layout/AppLayout.tsx",
          "operation": "modify",
          "description": "Ensure the header’s logo allocation keeps the icon perfectly centered and sized with equal width/height across breakpoints (including the mobile header), so the new circular clover mark remains a true circle. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}